7767517
94 107
Input            data                     0 1 data
Convolution      Conv_0                   1 1 data 300 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=1 6=9408
ReLU             Relu_1                   1 1 300 189
Pooling          MaxPool_2                1 1 189 190 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 190 190_splitncnn_0 190_splitncnn_1
Convolution      Conv_3                   1 1 190_splitncnn_1 303 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_4                   1 1 303 193
Convolution      Conv_5                   1 1 193 306 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_6                    2 1 306 190_splitncnn_0 196 0=0
ReLU             Relu_7                   1 1 196 197
Split            splitncnn_1              1 2 197 197_splitncnn_0 197_splitncnn_1
Convolution      Conv_8                   1 1 197_splitncnn_1 309 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_9                   1 1 309 200
Convolution      Conv_10                  1 1 200 312 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_11                   2 1 312 197_splitncnn_0 203 0=0
ReLU             Relu_12                  1 1 203 204
Split            splitncnn_2              1 3 204 204_splitncnn_0 204_splitncnn_1 204_splitncnn_2
Convolution      Conv_13                  1 1 204_splitncnn_2 315 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_14                  1 1 315 207
Convolution      Conv_15                  1 1 207 318 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Convolution      Conv_16                  1 1 204_splitncnn_1 321 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_17                   2 1 318 321 212 0=0
ReLU             Relu_18                  1 1 212 213
Split            splitncnn_3              1 2 213 213_splitncnn_0 213_splitncnn_1
Convolution      Conv_19                  1 1 213_splitncnn_1 324 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_20                  1 1 324 216
Convolution      Conv_21                  1 1 216 327 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         Add_22                   2 1 327 213_splitncnn_0 219 0=0
ReLU             Relu_23                  1 1 219 220
Split            splitncnn_4              1 3 220 220_splitncnn_0 220_splitncnn_1 220_splitncnn_2
Convolution      Conv_24                  1 1 220_splitncnn_2 330 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_25                  1 1 330 223
Convolution      Conv_26                  1 1 223 333 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Convolution      Conv_27                  1 1 220_splitncnn_1 336 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_28                   2 1 333 336 228 0=0
ReLU             Relu_29                  1 1 228 229
Split            splitncnn_5              1 2 229 229_splitncnn_0 229_splitncnn_1
Convolution      Conv_30                  1 1 229_splitncnn_1 339 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_31                  1 1 339 232
Convolution      Conv_32                  1 1 232 342 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         Add_33                   2 1 342 229_splitncnn_0 235 0=0
ReLU             Relu_34                  1 1 235 236
Split            splitncnn_6              1 3 236 236_splitncnn_0 236_splitncnn_1 236_splitncnn_2
Convolution      Conv_35                  1 1 236_splitncnn_2 345 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             Relu_36                  1 1 345 239
Convolution      Conv_37                  1 1 239 348 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
Convolution      Conv_38                  1 1 236_splitncnn_1 351 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=131072
BinaryOp         Add_39                   2 1 348 351 244 0=0
ReLU             Relu_40                  1 1 244 245
Split            splitncnn_7              1 2 245 245_splitncnn_0 245_splitncnn_1
Convolution      Conv_41                  1 1 245_splitncnn_1 354 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_42                  1 1 354 248
Convolution      Conv_43                  1 1 248 357 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
BinaryOp         Add_44                   2 1 357 245_splitncnn_0 251 0=0
ReLU             Relu_45                  1 1 251 252
Deconvolution    ConvTranspose_46         1 1 252 253 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=49152
BatchNorm        BatchNormalization_47    1 1 253 254 0=24
ReLU             Relu_48                  1 1 254 255
Convolution      Conv_49                  1 1 255 360 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
Convolution      Conv_50                  1 1 236_splitncnn_0 363 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_51                   2 1 360 363 260 0=0
ReLU             Relu_52                  1 1 260 261
Deconvolution    ConvTranspose_53         1 1 261 262 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        BatchNormalization_54    1 1 262 263 0=24
ReLU             Relu_55                  1 1 263 264
Convolution      Conv_56                  1 1 264 366 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
Convolution      Conv_57                  1 1 220_splitncnn_0 369 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
BinaryOp         Add_58                   2 1 366 369 269 0=0
ReLU             Relu_59                  1 1 269 270
Deconvolution    ConvTranspose_60         1 1 270 271 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        BatchNormalization_61    1 1 271 272 0=24
ReLU             Relu_62                  1 1 272 273
Convolution      Conv_63                  1 1 273 372 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
Convolution      Conv_64                  1 1 204_splitncnn_0 375 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
BinaryOp         Add_65                   2 1 372 375 278 0=0
ReLU             Relu_66                  1 1 278 279
Split            splitncnn_8              1 3 279 279_splitncnn_0 279_splitncnn_1 279_splitncnn_2
Convolution      Conv_67                  1 1 279_splitncnn_2 280 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             Relu_68                  1 1 280 281
Convolution      Conv_69                  1 1 281 282 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24
Convolution      Conv_70                  1 1 279_splitncnn_1 283 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             Relu_71                  1 1 283 284
Convolution      Conv_72                  1 1 284 285 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
Convolution      Conv_73                  1 1 279_splitncnn_0 286 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             Relu_74                  1 1 286 287
Convolution      Conv_75                  1 1 287 288 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
Sigmoid          Sigmoid_76               1 1 282 289
Permute          Transpose_77             1 1 289 290 0=3
Reshape          Reshape_79               1 1 290 292 0=1
Permute          Transpose_80             1 1 285 293 0=3
Reshape          Reshape_82               1 1 293 295 0=2
Permute          Transpose_83             1 1 288 296 0=3
Reshape          Reshape_85               1 1 296 298 0=2
Concat           Concat_86                3 1 292 295 298 ouput 0=-1
